[
	{
		"title": "Chocolate Eclair Dessert",
		"course": "Dessert",
		"totalTime": 120,
		"numberOfServings": 12,
		"ingredients": [
			"2 individual packages graham crackers ",
			"2 (3 ounce) packages instant vanilla pudding mix ",
			"3 cups milk ",
			"1 (8 ounce) container frozen whipped topping, thawed ",
			"1 (16 ounce) package prepared chocolate frosting "
		],
		"instructions": "Line the bottom of a 9x13-inch pan with graham crackers.\nIn a large bowl, combine pudding mix and milk; stir well. Mix whipped topping into pudding mixture. Spread half of mixture over graham cracker layer. Top with another layer of graham crackers and the remaining pudding.\nTop all with a final layer of graham crackers and frost with chocolate frosting. Refrigerate at least two hours before serving to allow the graham crackers to soften.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Dessert Crepes",
		"course": "Dessert",
		"totalTime": 20,
		"numberOfServings": 8,
		"ingredients": [
			"4 eggs, lightly beaten ",
			"1 1/3 cups milk ",
			"2 tablespoons butter, melted ",
			"1 cup all-purpose flour ",
			"2 tablespoons white sugar ",
			"1/2 teaspoon salt "
		],
		"instructions": "In large bowl, whisk together eggs, milk, melted butter, flour sugar and salt until smooth.\nHeat a medium-sized skillet or crepe pan over medium heat. Grease pan with a small amount of butter or oil applied with a brush or paper towel. Using a serving spoon or small ladle, spoon about 3 tablespoons crepe batter into hot pan, tilting the pan so that bottom surface is evenly coated. Cook over medium heat, 1 to 2 minutes on a side, or until golden brown. Serve immediately.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Apple Enchilada Dessert",
		"course": "Dessert",
		"totalTime": 35,
		"numberOfServings": 6,
		"ingredients": [
			"1 (21 ounce) can apple pie filling ",
			"6 (8 inch) flour tortillas ",
			"1 teaspoon ground cinnamon ",
			"1/3 cup margarine ",
			"1/2 cup white sugar ",
			"1/2 cup packed brown sugar ",
			"1/2 cup water "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpoon fruit evenly onto all tortillas, sprinkle with cinnamon. Roll up tortillas and place seam side down on lightly greased 8x8 baking pan.\nBring margarine, sugars and water to a boil in a medium sauce pan. Reduce heat and simmer, stirring constantly for 3 minutes.\nPour sauce evenly over tortillas; sprinkle with extra cinnamon on top if desired. Bake in preheated oven for 20 minutes.\nMakes 6 large tortillas; may be cut in half to serve 12.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Hot Fudge Ice Cream Bar Dessert",
		"course": "Dessert",
		"totalTime": 95,
		"numberOfServings": 12,
		"ingredients": [
			"1 (16 ounce) can chocolate syrup ",
			"3/4 cup peanut butter ",
			"19 ice cream sandwiches ",
			"1 (12 ounce) container frozen whipped topping, thawed ",
			"1 cup salted peanuts "
		],
		"instructions": "Pour the chocolate syrup into a medium microwave-safe bowl and microwave until hot, about 2 minutes on high, stopping every 30 seconds. Do not allow to boil. Stir peanut butter into hot chocolate until smooth. Allow to cool to room temperature.\nLine the bottom of a 9x13-inch dish with a layer of ice cream sandwiches. Spread half the whipped topping over the sandwiches. Spoon half the chocolate mixture over that. Top with half the peanuts. Repeat layers. Freeze until firm, at least 1 hour. Cut into squares to serve.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Strawberry Angel Food Dessert",
		"course": "Dessert",
		"totalTime": 15,
		"numberOfServings": 18,
		"ingredients": [
			"1 (10 inch) angel food cake ",
			"2 (8 ounce) packages cream cheese, softened ",
			"1 cup white sugar ",
			"1 (8 ounce) container frozen whipped topping, thawed ",
			"1 quart fresh strawberries, sliced ",
			"1 (18 ounce) jar strawberry glaze "
		],
		"instructions": "Crumble the cake into a 9x13 inch dish.\nBeat the cream cheese and sugar in a medium bowl until light and fluffy. Fold in whipped topping. Mash the cake down with your hands and spread the cream cheese mixture over the cake.\nIn a bowl, combine strawberries and glaze until strawberries are evenly coated. Spread over cream cheese layer. Chill until serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Sopapilla Cheesecake Dessert",
		"course": "Dessert",
		"totalTime": 180,
		"numberOfServings": 12,
		"ingredients": [
			"3 (8 ounce) packages cream cheese, softened ",
			"1 1/2 cups white sugar ",
			"1 1/2 teaspoons vanilla extract ",
			"2 (8 ounce) cans crescent roll dough ",
			"1/2 cup melted butter ",
			"1/2 cup white sugar ",
			"1 teaspoon ground cinnamon ",
			"1/4 cup sliced almonds "
		],
		"instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nBeat the cream cheese with 1 1/2 cups of sugar, and the vanilla extract in a bowl until smooth. Unroll the cans of crescent roll dough, and use a rolling pin to shape the each piece into 9x13 inch rectangles. Press one piece into the bottom of a 9x13 inch baking dish. Evenly spread the cream cheese mixture into the baking dish, then cover with the remaining piece of crescent dough.\nDrizzle the melted butter evenly over the top of the cheesecake. Stir the remaining 1/2 cup of sugar together with the cinnamon in a small bowl, and sprinkle over the cheesecake along with the almonds.\nBake in the preheated oven until the crescent dough has puffed and turned golden brown, about 45 minutes. Cool completely in the pan before cutting into 12 squares.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Great Pumpkin Dessert",
		"course": "Dessert",
		"totalTime": 65,
		"numberOfServings": 24,
		"ingredients": [
			"1 (15 ounce) can pumpkin puree ",
			"1 (12 fluid ounce) can evaporated milk ",
			"3 eggs ",
			"1 cup white sugar ",
			"4 teaspoons pumpkin pie spice ",
			"1 (18.25 ounce) package yellow cake mix ",
			"3/4 cup butter, melted ",
			"1 1/2 cups chopped walnuts "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, combine pumpkin, milk, eggs, sugar and spice. Mix well, and pour into a 9x13 inch pan.\nSprinkle dry cake mix over the top, then drizzle with melted butter. Top with walnuts.\nBake at 350 degrees F (175 degrees C) for 1 hour or until a knife inserted near the center comes out clean.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Chocolate Mint Dessert Brownies",
		"course": "Dessert",
		"totalTime": 125,
		"numberOfServings": 24,
		"ingredients": [
			"1 cup white sugar ",
			"1/2 cup butter, softened ",
			"4 eggs ",
			"1 1/2 cups chocolate syrup ",
			"1 cup all-purpose flour ",
			"2 cups confectioners' sugar ",
			"1/2 cup butter, softened ",
			"2 tablespoons creme de menthe liqueur ",
			"6 tablespoons butter ",
			"1 cup semisweet chocolate chips "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nIn a large bowl, cream together 1 cup sugar and 1/2 cup of softened butter until smooth. Beat in eggs one at a time, then stir in the chocolate syrup. Stir in the flour until just blended. Spread the batter evenly into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, or until top springs back when lightly touched. Cool completely in the pan.\nIn a small bowl, beat the confectioners' sugar, 1/2 cup butter or margarine and creme de menthe until smooth. Spread evenly over the cooled brownies, then chill until set.\nIn a small bowl over simmering water, or in the microwave, melt the remaining 6 tablespoons of butter and the chocolate chips, stirring occasionally until smooth. Allow to cool slightly, then spread over the top of the mint layer. Cover, and chill for at least 1 hour before cutting into squares.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Banana Chocolate Chip Dessert",
		"course": "Dessert",
		"totalTime": 40,
		"numberOfServings": 24,
		"ingredients": [
			"3/4 cup butter ",
			"2/3 cup white sugar ",
			"2/3 cup brown sugar ",
			"1 egg, beaten ",
			"1 teaspoon vanilla extract ",
			"1 cup mashed bananas ",
			"1 3/4 cups all-purpose flour ",
			"2 teaspoons baking powder ",
			"1/2 teaspoon salt ",
			"1 cup semisweet chocolate chips "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10x15 inch jelly roll pan.\nIn a large bowl, cream butter, white sugar and brown sugar until fluffy. Beat in egg and vanilla. Fold in mashed banana. In a separate bowl, mix flour, baking powder and salt. Fold flour mixture into butter mixture. Stir in chocolate chips. Spread in prepared pan.\nBake in preheated oven 20 minutes, until set. Cool before cutting into squares.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Tiramisu Toffee Dessert",
		"course": "Dessert",
		"totalTime": 80,
		"numberOfServings": 12,
		"ingredients": [
			"1 (10.75 ounce) package frozen prepared pound cake, thawed and cut into 9 slices ",
			"3/4 cup strong brewed coffee ",
			"1 (8 ounce) package cream cheese ",
			"1 cup white sugar ",
			"1/2 cup chocolate syrup ",
			"2 cups heavy whipping cream ",
			"2 (1.4 ounce) bars chocolate covered English toffee, chopped "
		],
		"instructions": "Arrange cake slices on bottom of a rectangular 11x7 inch baking dish, cutting cake slices if necessary to fit the bottom of the dish. Drizzle coffee over cake.\nBeat cream cheese, sugar, and chocolate syrup, in a large bowl with an electric mixer on medium speed until smooth. Add heavy cream; beat on medium speed until light and fluffy. Spread over cake. Sprinkle with chocolate-covered toffee candy.\nCover and refrigerate for at least 1 hour, but no longer than 24 hours, to set dessert and blend flavors.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Avocado Dessert",
		"course": "Dessert",
		"totalTime": 40,
		"numberOfServings": 4,
		"ingredients": [
			"1 avocado, peeled and pitted ",
			"1/2 cup milk ",
			"1/4 cup white sugar ",
			"1/2 teaspoon vanilla extract "
		],
		"instructions": "Mash avocado with an electric mixer, or use a food processor. Blend in the milk, sugar and vanilla until smooth. Chill for about 20 minutes before serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "No Bake Double Good Dessert",
		"course": "Dessert",
		"totalTime": 45,
		"numberOfServings": 36,
		"ingredients": [
			"20 chocolate sandwich cookies, crushed ",
			"1 (8 ounce) package cream cheese, softened ",
			"2 cups confectioners' sugar ",
			"3/4 cup peanut butter ",
			"1 (12 ounce) container frozen whipped topping, thawed "
		],
		"instructions": "Press crushed cookies into the bottom of a 9x13 inch pan, reserving a few for decoration. In a medium bowl, beat together the cream cheese and confectioners' sugar. Stir in the peanut butter until well blended, then fold in the whipped topping. Spread over the crushed cookie base, sprinkle the remaining cookie chunks on top, and freeze for 1 to 2 hours. Thaw 10 to 15 minutes before cutting and serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Strawberry Whipped Sensation",
		"course": "Dessert",
		"totalTime": 380,
		"numberOfServings": 12,
		"ingredients": [
			"4 cups fresh strawberries, divided ",
			"1 (14 ounce) can Eagle Brand® Sweetened Condensed Milk ",
			"1/4 cup lemon juice ",
			"1 (8 ounce) tub COOL WHIP Whipped Topping, thawed, divided ",
			"8 OREO Chocolate Sandwich Cookies, finely chopped ",
			"1 tablespoon butter, melted "
		],
		"instructions": "Line 9x5-inch loaf pan with foil, with ends of foil extending over sides of pan. Mash 2 cups of the strawberries in large bowl. Add condensed milk, juice and 2 cups of the whipped topping; mix well. Pour into prepared pan.\nMix chopped cookies and butter. Spoon over whipped topping mixture. Cover with ends of foil and gently press cookie mixture into whipped topping mixture. Freeze 6 hours or until firm.\nInvert dessert onto serving plate when ready to serve; remove pan and foil. Spread remaining whipped topping onto top and sides of dessert. Slice remaining 2 cups strawberries; arrange over dessert. Store leftovers in freezer.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Pumpkin Chocolate Dessert Cake",
		"course": "Dessert",
		"totalTime": 60,
		"numberOfServings": 12,
		"ingredients": [
			"2 2/3 cups all-purpose flour ",
			"2/3 cup unsweetened cocoa powder ",
			"1 1/2 tablespoons pumpkin pie spice ",
			"2 teaspoons baking powder ",
			"1 teaspoon baking soda ",
			"3/4 cup butter ",
			"2 cups white sugar ",
			"1/3 cup applesauce ",
			"3 eggs, beaten ",
			"1/2 cup heavy cream ",
			"1 (15 ounce) can pumpkin ",
			"1 cup brown sugar ",
			"1/2 cup butter ",
			"1/3 cup heavy cream ",
			"1 cup confectioners' sugar "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch Bundt pan.\nIn a medium bowl, mix the flour, cocoa powder, pumpkin pie spice, baking powder and baking soda. In a large bowl, beat together 3/4 cup butter, 2 cups sugar, applesauce, and eggs. Mix in 1/2 cup heavy cream and pumpkin. Stir into the flour mixture just until blended. Spread evenly in the prepared pan.\nBake 40 minutes in the preheated oven, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool in the pan over a wire rack. Invert cake onto a serving plate.\nPlace the brown sugar, 1/2 cup butter, and 1/3 cup heavy cream in a medium saucepan. Bring to a boil while stirring to blend until smooth. Cook until sugar is dissolved. Whisk in the confectioner's sugar, and drizzle over the cake immediately.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Lemon Cream Cheese Bars",
		"course": "Dessert",
		"totalTime": 125,
		"numberOfServings": 24,
		"ingredients": [
			"cooking spray ",
			"2 (8 ounce) packages refrigerated crescent roll dough (such as Pillsbury® Recipe Creations®), divided ",
			"2 lemons, zested and juiced, divided ",
			"2 (8 ounce) packages cream cheese, softened ",
			"1/2 cup white sugar ",
			"2 tablespoons butter, melted ",
			"3 tablespoons white sugar "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Line the bottom of a 9x13-inch baking dish with aluminum foil and spray with cooking spray.\nPress 1 can crescent roll dough into the bottom of the prepared baking dish, stretching to the edges.\nMix the zest of 1 1/2 lemons and juice from 2 lemons together in a bowl. Beat cream cheese and 1/2 cup sugar into lemon zest mixture using an electric mixer until smooth and creamy; spread over crescent roll dough layer.\nUnroll the second can of crescent roll dough and layer over cream cheese mixture, gently stretching dough to the edges. Brush melted butter over crescent roll dough layer. Mix remaining lemon zest and 3 tablespoons sugar together in a bowl; sprinkle over butter.\nBake in the preheated oven until top is golden brown, about 30 minutes. Allow to cool for about 20 minutes. Lift dessert from baking dish using foil; transfer to a cutting board. Cut into squares, leaving on foil. Return dessert to the baking dish and refrigerate until chilled, at least 1 hour.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Dessertlover's Classic Caramel Sauce",
		"course": "Dessert",
		"totalTime": 55,
		"numberOfServings": 16,
		"ingredients": [
			"1/3 cup water ",
			"1 1/2 cups white sugar ",
			"2 tablespoons unsalted butter ",
			"1 1/4 cups heavy cream ",
			"1/2 teaspoon vanilla extract ",
			"1 pinch salt "
		],
		"instructions": "Bring the water, sugar, and butter to a simmer in a saucepan over medium heat. Do not stir the mixture until the sugar has completely dissolved in the water. Cook uncovered, stirring occasionally, until the caramel has turned golden brown, 5 to 10 minutes.\nCarefully pour in a slow, steady stream of cream into the caramel while stirring constantly. The hot caramel will boil vigorously when the cream is added and solidify in areas. Add the vanilla extract and salt. Continue stirring over low heat until the caramel is smooth and creamy, 5 to 10 minutes more. Allow to cool for at least half an hour before using.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Balsamic Strawberries",
		"course": "Dessert",
		"totalTime": 12,
		"numberOfServings": 4,
		"ingredients": [
			"1 tablespoon butter ",
			"2 cups fresh strawberries, hulled and halved ",
			"1/4 cup granular sucrolose sweetener (such as Splenda®) ",
			"1 tablespoon balsamic vinegar ",
			"4 scoops low-fat vanilla ice cream "
		],
		"instructions": "Melt butter in a large skillet over medium heat. Add the strawberry halves, sucrolose sweetener, and balsamic vinegar. Cook until the strawberries are heated through and darkened to a ruby red.\nPlace scoops of ice cream into dessert bowls or stemmed glasses. Spoon strawberries over the ice cream and serve.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Apple Dumplings with Rich Cinnamon Sauce",
		"course": "Dessert",
		"totalTime": 55,
		"numberOfServings": 8,
		"ingredients": [
			"5 tablespoons softened butter ",
			"1 cup packed dark brown sugar ",
			"2 teaspoons ground cinnamon ",
			"1/4 cup chopped toasted pecans or walnuts ",
			"4 apples (any variety but Red Delicious) peeled, halved, and cored, a thin sliver cut off bottoms so apples sit flat ",
			"1 (15 ounce) container 9-inch pie crusts ",
			"1 egg white ",
			"2 tablespoons sugar ",
			"2 teaspoons cornstarch "
		],
		"instructions": "Adjust oven rack to lower-middle position and heat oven to 425 degrees.\nMix 3 Tbs. of butter, 1/2 cup of brown sugar, 1 tsp. cinnamon and all the nuts in a small bowl. Spoon a portion of the mixture into each hollowed-out apple core.\nFor boxed pie crusts, unroll one of the dough sheets onto a floured work surface. Pulling on sides of dough to straighten rounded edges, roll it into an approximate 12-inch square, then cut the dough into four 6-inch squares; brush the perimeter of each square with egg white. Set an apple half on each square. Bring up the 4 corners of dough around the apple and pinch edges to seal. Place on a large (at least 18- by 12-inch) parchment-covered baking dish. Brush dumpling tops and sides with egg white; sprinkle with sugar. Repeat process with remaining apples and dough.\nBake dumplings until pastry sets and starts to turn golden brown, about 10 minutes. Reduce heat to 375 and bake until golden brown, about 20 minutes longer.\nWhile apples bake, bring 1 cup water, the remaining 2 Tbs. butter, 1/2 cup brown sugar and 1 tsp. cinnamon to boil in asmall saucepan over medium heat. Dissolve cornstarch in 2 tsps. water; whisk into hot syrup for a smooth sauce. Cover, keep warm.\nFor each serving, spoon a portion of sauce on a dessert plate. Set apple dumpling over warm sauce; serve immediately.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Caramel Macchiato Ice Cream",
		"course": "Dessert",
		"totalTime": 250,
		"numberOfServings": 12,
		"ingredients": [
			"1 cup milk ",
			"2 tablespoons instant coffee granules ",
			"1 cup white sugar ",
			"1 pinch salt ",
			"2 cups heavy cream ",
			"3/4 cup caramel dessert sauce "
		],
		"instructions": "Whisk together milk, instant coffee granules, sugar, and salt in a large bowl until sugar is dissolved. Stir in the heavy cream, then cover and refrigerate until chilled, at least 2 hours.\nPour the chilled mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Transfer half of the ice cream to a one- or two-quart lidded plastic container. Pour half of the caramel sauce over the top, then repeat the layers with the remaining ice cream and caramel. Swirl the caramel into the ice cream using a chopstick or knife. Cover surface with plastic wrap and seal. For best results, ice cream should ripen in the freezer for at least 2 hours or overnight.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Dessert Pizza",
		"course": "Dessert",
		"totalTime": 30,
		"numberOfServings": 12,
		"ingredients": [
			"1 (18 ounce) package refrigerated sugar cookie dough ",
			"1 (8 ounce) container frozen whipped topping, thawed ",
			"1/2 cup sliced banana ",
			"1/2 cup sliced fresh strawberries ",
			"1/2 cup crushed pineapple, drained ",
			"1/2 cup seedless grapes, halved "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPress cookie dough evenly into a 12 inch pizza pan. Bake in preheated oven for 15 to 20 minutes, until golden brown. Cool in pan on wire rack.\nSpread whipped topping over cooled crust. Arrange fruit in a decorative pattern. Refrigerate until ready to serve.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Strawberry Twinkie Dessert",
		"course": "Dessert",
		"totalTime": 80,
		"numberOfServings": 18,
		"ingredients": [
			"4 cups sliced fresh strawberries ",
			"1 (18.75 ounce) can ready-to-use strawberry glaze ",
			"8 Twinkies ",
			"1 (8 ounce) package cream cheese, softened ",
			"1 (14 ounce) can sweetened condensed milk ",
			"1 (12 ounce) container frozen whipped topping, thawed "
		],
		"instructions": "Combine strawberries and glaze in a small bowl.\nSlice Twinkies in half lengthwise, and place in a single layer over the bottom of a 9 x 13 inch dish.\nIn a mixing bowl, beat cream cheese and condensed milk until smooth. Fold in whipped topping, and spread mixture over Twinkies. Spoon berries over cream cheese mixture. Cover and chill 30 minutes or more. Refrigerate leftovers.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Roasted Pears with Caramel Sauce",
		"course": "Dessert",
		"totalTime": 50,
		"numberOfServings": 4,
		"ingredients": [
			"4 tablespoons butter ",
			"1 cup packed dark brown sugar ",
			"4 pears, halved and cored ",
			"1/2 cup sour cream ",
			"1/4 cup coarsely chopped toasted pistachios (or your favorite nuts) "
		],
		"instructions": "Adjust oven rack to center position and heat oven to 400 degrees. Place butter in a baking pan large enough to hold the pears in a single layer: set in the heating oven until it melts.\nSprinkle sugar over melted butter, then place pears, cut side down, on top. Bake until tender, about 30 minutes.\nRemove pan from oven, turn pears over and baste with pan sauce. Return to oven; bake until golden and glossy, about 10 minutes longer.\nLet cool slightly. Transfer pears to dessert plates or bowls. Top each with dollop of sour cream, drizzle with caramel pan sauce, sprinkle with nuts and serve.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Ultimate Chocolate Dessert",
		"course": "Dessert",
		"totalTime": 260,
		"numberOfServings": 4,
		"ingredients": [
			"4 ounces bittersweet chocolate, chopped ",
			"1/2 teaspoon instant coffee ",
			"1 pinch salt ",
			"1 cup heavy cream ",
			"3 tablespoons white sugar ",
			"1/2 teaspoon vanilla extract "
		],
		"instructions": "Stir chocolate, instant coffee, and salt together in a medium bowl.\nHeat cream, sugar, and vanilla in a saucepan over medium heat, stirring constantly, until it just begins to simmer.\nPour hot cream mixture over the chocolate mixture; let sit for 1 minute.\nWhisk the chocolate and cream mixture for 1-2 minutes until combined.\nPour the mixture into four small espresso cups. Tap to remove any air bubbles. Chill thoroughly in the refrigerator for at least 4 hours.\nServe topped with grated chocolate, or add lightly whipped cream and dust with cocoa powder.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Banana Split Bars",
		"course": "Dessert",
		"totalTime": 390,
		"numberOfServings": 20,
		"ingredients": [
			"2 cups graham cracker crumbs ",
			"1/2 cup white sugar ",
			"1/2 cup butter ",
			"16 ounces cream cheese, softened ",
			"1 cup white sugar ",
			"1 teaspoon vanilla extract ",
			"3 bananas, sliced ",
			"1 (20 ounce) can crushed pineapple, well drained ",
			"1 (12 ounce) container frozen whipped topping, thawed ",
			"1/2 cup chopped walnuts ",
			"1 (4 ounce) jar maraschino cherries, halved "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt the butter or margarine over low heat. Remove from heat and add 1/2 cup sugar and graham cracker crumbs. Press into a 9 x 13 inch pan. Bake for 15 minutes; let cool.\nCream together the cream cheese, 1 cup of white sugar and vanilla. Spread over graham cracker crust.\nLayer sliced bananas, drained pineapple and whipped cream dessert topping on top of bars in order given. Sprinkle with chopped nuts, then with cherries. Cover and refrigerate 6 hours or overnight. Cut into squares and enjoy!!\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Chocolate Bundt Cake",
		"course": "Dessert",
		"totalTime": 120,
		"numberOfServings": 12,
		"ingredients": [
			"3 cups all-purpose flour ",
			"1/2 teaspoon baking powder ",
			"1/2 teaspoon salt ",
			"1/2 cup unsweetened cocoa powder ",
			"1 cup butter, softened ",
			"1/2 cup shortening ",
			"3 cups white sugar ",
			"1 teaspoon vanilla extract ",
			"5 eggs ",
			"1 cup milk "
		],
		"instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan. Sift flour, baking powder, salt and cocoa. Set aside.\nIn a large bowl, cream butter, shortening, sugar, and vanilla until light and fluffy. Add eggs one at a time, beating well after each. Add flour mixture alternately with the milk. Mix well.\nPour into 10 inch Bundt pan. Bake at 325 F (165 degrees C) for 70 minutes or until a toothpick inserted into cake comes out clean. Let cool for 10 minutes in the pan, then turn out onto a wire rack and cool completely.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Chocolate Caramel Candy",
		"course": "Dessert",
		"totalTime": 145,
		"numberOfServings": 96,
		"ingredients": [
			"1 cup milk chocolate chips ",
			"1/4 cup butterscotch chips ",
			"1/4 cup creamy peanut butter ",
			"1/4 cup butter ",
			"1 cup white sugar ",
			"1/4 cup evaporated milk ",
			"1 1/2 cups marshmallow creme ",
			"1/4 cup creamy peanut butter ",
			"1 teaspoon vanilla extract ",
			"1 1/2 cups chopped salted peanuts ",
			"1 (14 ounce) package caramels ",
			"1/4 cup heavy whipping cream ",
			"1 cup milk chocolate chips ",
			"1/4 cup butterscotch chips ",
			"1/4 cup creamy peanut butter "
		],
		"instructions": "Lightly grease one 13 x 9 inch pan.\nTo Make Base: Combine 1 cup milk chocolate chips, 1/4 cup butterscotch chips and 1/4 cup creamy peanut butter in a small saucepan. Cook, stirring constantly, over low heat until melted and smooth. Spread into the bottom of the prepared pan. Refrigerate until set.\nTo Make Filling: In a heavy saucepan melt the butter over medium-high heat. Stir in sugar and evaporated milk. Bring mixture to a boil and stir for 5 minutes. Remove from heat and stir in the marshmallow cream, 1/4 cup of the peanut butter, and the vanilla. Add the peanuts, and spread over the base layer. Refrigerate until set.\nTo Make Caramel Layer: Combine the caramels and cream in a saucepan, stir over low heat until melted and smooth. Spread over the top of the filling and refrigerate until smooth.\nTo Make Frosting Layer: In another saucepan combine 1 cup milk chocolate chips, 1/4 butterscotch chips and 1/4 cup peanut butter, and stir over low heat until melted and smooth. Pour over the caramel layer. Refrigerate for at least 1 hour. Cut into 1 inch squares. Store in the refrigerator.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "French Apple Pie with Cream Cheese Topping",
		"course": "Dessert",
		"totalTime": 120,
		"numberOfServings": 8,
		"ingredients": [
			"1/4 cup butter, softened ",
			"1 cup white sugar ",
			"1 egg ",
			"1/4 teaspoon salt ",
			"1 teaspoon ground cinnamon ",
			"1 teaspoon ground nutmeg ",
			"1 teaspoon baking soda ",
			"1 cup all-purpose flour ",
			"1/2 cup chopped walnuts ",
			"2 1/2 cups diced apple without peel ",
			"1 teaspoon vanilla extract ",
			"2 tablespoons hot water ",
			"3 ounces cream cheese, softened ",
			"3 tablespoons unsalted butter, softened ",
			"1/2 teaspoon vanilla extract ",
			"1 1/2 cups sifted confectioners' sugar "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch pie pan.\nCombine 1/4 cup butter, white sugar, egg, salt, cinnamon, nutmeg, soda, flour, nuts, apples, 1 teaspoon vanilla, and hot water in the order given. (Batter will be thick). Pour into pie pan.\nBake for 45 minutes at 350 degrees F (175 degrees C).\nServe with cream cheese frosting. To make frosting: mix cream cheese, 3 tablespoons butter, 1/2 teaspoon vanilla, and sifted confectioners' sugar. Beat until smooth. Can serve hot or warm. Also, can refrigerate and let cream cheese topping set up for a cold dessert.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Piggy Pudding Dessert Cake",
		"course": "Dessert",
		"totalTime": 45,
		"numberOfServings": 24,
		"ingredients": [
			"1/2 cup butter ",
			"1 1/2 cups all-purpose flour ",
			"1 cup chopped walnuts ",
			"1 (16 ounce) package frozen whipped topping, thawed ",
			"1 (8 ounce) package cream cheese ",
			"1 cup confectioners' sugar ",
			"1 (3.9 ounce) package instant chocolate pudding mix ",
			"3 cups milk ",
			"1/2 cup chopped walnuts "
		],
		"instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl, combine butter or margarine, flour and chopped walnuts. Mix, then pat into bottom of 9x13 \" pan.\nBake at 375 degrees F (190 degrees C) for 20 minutes. Allow to cool.\nBeat softened cream cheese with confectioners sugar until smooth. Fold in 1/2 of the whipped topping. Spread over cooled crust.\nIn a medium bowl, combine chocolate pudding mix with 3 cups milk. Mix well and spread over cream cheese mixture.\nSpread remaining 1/2 container of whipped topping over pudding. Sprinkle with 1/2 cup chopped nuts.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Banana Caramel Fluff",
		"course": "Dessert",
		"totalTime": 18,
		"numberOfServings": 4,
		"ingredients": [
			"2 bananas, peeled and sliced ",
			"1 tablespoon vanilla extract ",
			"2 tablespoons butter, melted ",
			"1 (8 ounce) can refrigerated crescent rolls ",
			"1 cup caramel topping "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, combine bananas, vanilla and melted butter, until bananas are well coated. On a cookie sheet, unroll two crescent rolls, leaving the two triangles attached to form a square. Place 1/4 of banana mixture in the center of each pair of rolls.\nBake for 11 to 13 minutes, or until pastry is golden brown. Heat caramel topping and drizzle over dessert. Serve warm.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Hot Fudge Pudding Cake II",
		"course": "Dessert",
		"totalTime": 60,
		"numberOfServings": 12,
		"ingredients": [
			"1 3/4 cups white sugar ",
			"1 1/2 cups all-purpose flour ",
			"10 tablespoons unsweetened cocoa powder ",
			"3 teaspoons baking powder ",
			"1/4 teaspoon salt ",
			"3/4 cup milk ",
			"1/2 cup butter, melted ",
			"1 1/2 teaspoons vanilla extract ",
			"3/4 cup packed brown sugar ",
			"1 2/3 cups hot water "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the 2/3 cup sugar, flour, 5 tablespoons of the cocoa, baking powder and salt. Blend in milk, melted butter and vanilla; beat until smooth. Pour batter into one 9 inch square baking dish.\nIn separate bowl, stir together the remaining white sugar, brown sugar and the remaining cocoa; sprinkle mixture evenly over batter. Pour hot water over top. Do not stir!\nBake at 350 degrees F (175 degrees C) for 35 to 40 minutes or until center is almost set. Let stand for 15 minutes. Then spoon into dessert dishes, spooning sauce from bottom of pan over top.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Chocolate Delight",
		"course": "Dessert",
		"totalTime": 45,
		"numberOfServings": 12,
		"ingredients": [
			"2 (8 or 9 inch) baked round chocolate cake layers, cooled ",
			"1 cup coffee-flavored liqueur ",
			"2 (5.9 ounce) packages instant chocolate pudding mix ",
			"4 cups milk, or as needed ",
			"6 (1.4 ounce) bars chocolate covered toffee bars, chopped ",
			"2 (12 ounce) containers frozen whipped topping, thawed ",
			"1 (1 ounce) square semisweet chocolate "
		],
		"instructions": "Cut chocolate cake into large squares and place on a baking sheet or large baking dish (see Cook's Note). Pour coffee-flavored liqueur over cake and set aside. Prepare chocolate pudding with milk according to package directions.\nIn large trifle bowl or other glass bowl, crumble half of liqueur-moistened cake. Top cake with half of chocolate pudding, half of crumbled candy bars, and one container of whipped topping. Repeat with remaining cake, pudding, candy bars, and Cool Whip(R). Shave chocolate with a vegetable peeler for garnish; sprinkle over top of dessert. Keep refrigerated until serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Lemon Poppy Seed Dessert Cake",
		"course": "Dessert",
		"totalTime": 50,
		"numberOfServings": 12,
		"ingredients": [
			"1 (18.25 ounce) package lemon cake mix ",
			"1 (3.4 ounce) package instant vanilla pudding mix ",
			"4 eggs ",
			"3/4 cup vegetable oil ",
			"1 1/4 cups water ",
			"1/2 cup poppy seeds ",
			"1 (21 ounce) can lemon pie filling ",
			"1 (3.4 ounce) package instant lemon pudding mix ",
			"1 cup milk ",
			"1 (8 ounce) container frozen whipped topping, thawed "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl, stir together cake mix and vanilla pudding mix. Make a well in the center and pour in eggs, oil water and poppy seeds. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pan.\nBake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool completely. Spread lemon pie filling over the cooled cake.\nIn a large bowl, mix instant lemon pudding with milk. Mix well and let stand about 5 minutes until fairly set. Fold in thawed whipped topping. Spread over pie filling. Refrigerate for at least 4 hours before serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Lemon Delight",
		"course": "Dessert",
		"totalTime": 70,
		"numberOfServings": 12,
		"ingredients": [
			"1 cup all-purpose flour ",
			"1/2 cup butter, melted ",
			"1 cup ground pecans ",
			"1 (8 ounce) package cream cheese ",
			"1 cup confectioners' sugar ",
			"1 (21 ounce) can lemon pie filling ",
			"1 (12 ounce) container frozen whipped topping, thawed "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). In a 7x11 inch baking dish, combine flour, melted butter and half of pecans. Spread mixture evenly and bake 25 minutes, or until golden brown. Let cool completely.\nIn medium bowl, cream together cream cheese and confectioners' sugar until smooth. Spread over cooled crust. Chill 30 minutes in refrigerator.\nSpread lemon pie filling over chilled dessert. Spread whipped topping over lemon filling, and top with remaining pecans. Refrigerate until serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Strawberry Delight Dessert Pie",
		"course": "Dessert",
		"totalTime": 300,
		"numberOfServings": 12,
		"ingredients": [
			"1 1/2 cups graham cracker crumbs ",
			"1/4 cup white sugar ",
			"1/3 cup butter, melted ",
			"1 (8 ounce) package cream cheese ",
			"1/4 cup white sugar ",
			"2 tablespoons milk ",
			"3 1/2 cups frozen whipped topping, thawed ",
			"2 pints fresh strawberries, sliced ",
			"2 (3.4 ounce) packages instant vanilla pudding mix ",
			"3 1/2 cups milk "
		],
		"instructions": "In a medium bowl, mix graham cracker crumbs, 1/4 cup sugar and melted butter until well blended . Press mixture into the bottom of a 9x13 inch pan. Chill in freezer while you make the filling.\nIn a large bowl, beat the cream cheese with 1/4 cup sugar and 2 tablespoons milk until smooth. Fold in 1/2 of the whipped topping.. Spread filling over crust. Place the strawberries in an even layer over filling. Prepare instant pudding as directed on package, but using only 3 1/2 cups milk. Spread prepared pudding over strawberries. Chill 4 hours or overnight.\nBefore serving, spread remaining whipped topping over pudding.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Pumpkin Pie Cake I",
		"course": "Dessert",
		"totalTime": 90,
		"numberOfServings": 18,
		"ingredients": [
			"1 (29 ounce) can pumpkin puree ",
			"1 (12 fluid ounce) can evaporated milk ",
			"3 eggs ",
			"1 cup white sugar ",
			"2 teaspoons ground cinnamon ",
			"1 teaspoon ground nutmeg ",
			"1/2 teaspoon ground ginger ",
			"1/2 teaspoon ground cloves ",
			"1 (18.25 ounce) package yellow cake mix ",
			"1 cup butter ",
			"1 cup chopped walnuts "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9 x 13 inch pan with parchment paper.\nIn a large bowl, combine pumpkin, evaporated milk, eggs, sugar, cinnamon, nutmeg, ginger and cloves. Mix until smooth and pour into a 9x13 inch pan.\nSprinkle dry cake mix over pumpkin mixture, then sprinkle chopped nuts and pat down gently. Melt butter or margarine and drizzle over cake.\nBake at 350 degrees F (175 degrees C) for approximately 45 to 60 minutes. (Be sure to check the cake after 45 minutes because oven temperatures vary.)\nAfter cake cools, turn it upside down so the top of the cake will be the crust. Remove the parchment paper. Top with dessert topping (optional) before serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "EZ Peanut Butter Pie I",
		"course": "Dessert",
		"totalTime": 240,
		"numberOfServings": 8,
		"ingredients": [
			"1 (8 ounce) package cream cheese, softened ",
			"1 cup white sugar ",
			"1 teaspoon vanilla extract ",
			"2/3 cup creamy peanut butter ",
			"1 (8 ounce) container frozen whipped topping, thawed ",
			"1 (9 inch) pie shell, baked "
		],
		"instructions": "Beat the cream cheese, sugar and vanilla together. Add the peanut butter and mix well. Fold in the dessert topping until completely blended.\nFill the pie crust with the peanut butter mixture and chill in the freezer until ready to serve. Note: Good in a chocolate crust with chocolate chips sprinkled on top.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Heavenly 'Apple of My Thigh' Dessert",
		"course": "Dessert",
		"totalTime": 40,
		"numberOfServings": 8,
		"ingredients": [
			"1 (8 ounce) package cream cheese, at room temperature ",
			"1/4 cup white sugar ",
			"3/4 cup caramel ice cream topping ",
			"3 (1.4 ounce) bars chocolate covered English toffee, chopped ",
			"5 green apples, cored and sliced "
		],
		"instructions": "Mix together the cream cheese, sugar and 1/4 cup of the caramel sauce in a medium bowl. Spread onto a serving tray or a plate. Drizzle the remaining caramel sauce over the top and sprinkle with pieces of chocolate covered toffee. Refrigerate for 30 minutes, then serve with apple slices.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Annie's Strawberry Dessert",
		"course": "Dessert",
		"totalTime": 515,
		"numberOfServings": 16,
		"ingredients": [
			"1 cup butter, softened ",
			"1 1/2 cups all-purpose flour ",
			"1 cup chopped pecans ",
			"1 (8 ounce) package cream cheese, softened ",
			"2 1/2 cups confectioners' sugar ",
			"1 (12 ounce) container frozen whipped topping, thawed ",
			"1 1/2 quarts fresh strawberries, halved ",
			"1 (8 ounce) jar ready-to-use strawberry glaze "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix the butter, flour, and pecans in a bowl, and press into a 9x13 inch baking dish.\nBake 10 to 15 minutes; do not allow to brown. Set aside until completely cool.\nIn a bowl, mix the cream cheese and confectioners' sugar until smooth. Blend in the whipped topping. Spread over the cooled crust. Refrigerate 8 hours, or overnight.\nTop with strawberries and drizzle with glaze to serve.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Strawberry Yogurt Pie I",
		"course": "Dessert",
		"totalTime": 25,
		"numberOfServings": 8,
		"ingredients": [
			"2 (8 ounce) containers strawberry flavored yogurt ",
			"1 (12 ounce) container frozen whipped topping, thawed ",
			"1 cup strawberries, finely chopped ",
			"1 (9 inch) prepared graham cracker crust "
		],
		"instructions": "Mix yogurt with 3 and 1/2 cups of the dessert topping until blended. Sweeten the strawberries, if necessary. Mix in strawberries and spoon into crust.\nFreeze for at least 3 hours or overnight, if possible, until it's firm.\nRemove from freezer and top with remainder of dessert topping. Store in freezer.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Strawberries and Wine",
		"course": "Dessert",
		"totalTime": 130,
		"numberOfServings": 6,
		"ingredients": [
			"3 cups fresh strawberries, hulled and quartered lengthwise ",
			"3/4 cup white sugar, or to taste ",
			"1 1/2 cups white wine "
		],
		"instructions": "Place strawberries into a medium bowl. Dust with sugar, then pour the wine over them. Cover and refrigerate for 2 to 3 hours.\nLet the strawberries stand at room temperature for 15 to 20 minutes before serving. Spoon berries into 6 dessert cups, and distribute the remaining wine over the berries.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Chocolate Chip Kiss Cookies",
		"course": "Dessert",
		"totalTime": 120,
		"numberOfServings": 24,
		"ingredients": [
			"48 milk chocolate candy kisses, unwrapped ",
			"1 cup butter, softened ",
			"1/3 cup white sugar ",
			"1/3 cup packed brown sugar ",
			"1 teaspoon vanilla extract ",
			"2 cups all-purpose flour ",
			"1 cup mini semi-sweet chocolate chips "
		],
		"instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn large mixing bowl, beat butter or margarine, sugar, brown sugar and vanilla until well blended. Add flour, blend until smooth. Stir in small chocolate chips.\nUnwrap chocolate kiss candies. Mold scant tablespoons of dough around each chocolate piece, covering completely. Shape into balls; place on ungreased cookie sheet.\nShape into balls; place on ungreased cookie sheet. Bake 10 to 12 minutes or until set. Cool slightly; remove from cookie sheet to wire rack. Cool completely. NOTE: I buy chocolate dessert topping and drizzle over cooled cookies.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Microwave Cake",
		"course": "Dessert",
		"totalTime": 20,
		"numberOfServings": 12,
		"ingredients": [
			"1 (18.25 ounce) package yellow cake mix ",
			"3 eggs ",
			"1 (21 ounce) can apple pie filling ",
			"1/2 cup applesauce "
		],
		"instructions": "Mix the box of cake mix, eggs, pie filling and applesauce till moist. Use a microwave safe bundt pan or substitute a microwave safe bowl that has a microwave safe cup or cone placed in the middle of it (to mimic a bundt pan). Pour mixture into the bowl around the cup.\nBake on high for 6 minutes 30 seconds, turn and bake for another 6 minutes 30 seconds on high. Remove from oven and cover bowl with a dish and let stand for 5 minutes (this finishes the cooking process).\nTurn cake over onto dish and remove cone (cup) for a delicious quick dessert. Good hot with vanilla ice cream or whipped topping.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Watermelon Pie",
		"course": "Dessert",
		"totalTime": 15,
		"numberOfServings": 8,
		"ingredients": [
			"1 (3 ounce) package watermelon flavored Jell-O® ",
			"1/4 cup water ",
			"1 (12 ounce) container frozen whipped topping, thawed ",
			"2 cups watermelon ",
			"1 (9 inch) prepared graham cracker crust "
		],
		"instructions": "Mix together the watermelon gelatin and water. Fold gelatin mixture into the dessert topping. Add cut watermelon.\nPour mixture into graham cracker crust. Cool in refrigerator for about 3 hours.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Lemon Whip Dessert",
		"course": "Dessert",
		"totalTime": 20,
		"numberOfServings": 6,
		"ingredients": [
			"60 buttery round crackers, crushed ",
			"1/4 cup confectioners' sugar ",
			"1/2 cup melted butter ",
			"1 (6 ounce) can frozen lemonade concentrate ",
			"1 (14 ounce) can sweetened condensed milk ",
			"1 (12 ounce) container frozen whipped topping, thawed "
		],
		"instructions": "In a mixing bowl, combine the crushed crackers, confectioners sugar and melted butter. Press into the bottom of a 9x13 inch pan; reserve 1/3 cup for sprinkling on top.\nBlend together the lemonade, sweetened condensed milk and whipped topping. Pour over crust and sprinkle with remaining crumb mixture. If desired, garnish with thinly sliced lemons.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Glorified Rice",
		"course": "Dessert",
		"totalTime": 45,
		"numberOfServings": 4,
		"ingredients": [
			"1 cup uncooked white rice ",
			"1/4 cup white sugar ",
			"2 (15 ounce) cans crushed pineapple ",
			"1 cup miniature marshmallows ",
			"1 cup heavy cream, whipped ",
			"6 maraschino cherries "
		],
		"instructions": "In a saucepan bring 2 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nIn a large bowl combine the cooked, cooled rice, sugar, pineapple and marshmallows. Fold in the whipped cream. Chill for 4 hours.\nSpoon the rice mixture into 6 dessert dishes and place a cherry on top of each.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Panna Cotta With Fresh Strawberry Sauce",
		"course": "Dessert",
		"totalTime": 275,
		"numberOfServings": 6,
		"ingredients": [
			"1 1/2 cups milk ",
			"1 (.25 ounce) envelope unflavored gelatin ",
			"1 1/2 cups whipping cream ",
			"1/4 cup white sugar ",
			"2 teaspoons vanilla extract ",
			"1 quart fresh strawberries, quartered ",
			"2 teaspoons vanilla extract ",
			"1/4 cup white sugar ",
			"1/4 cup water "
		],
		"instructions": "Pour the milk into a bowl; sprinkle the gelatin over the milk. Allow mixture to sit until the gelatin softens, about 5 minutes.\nCombine the cream and 1/4 cup sugar in a saucepan over medium heat. Stir in the gelatin mixture; cook and stir until gelatin dissolves completely, about 3 minutes. Add the vanilla extract. Pour the mixture evenly into ramekins; cover and chill at least 4 hours.\nTo make the strawberry sauce, combine the strawberries, 2 teaspoon vanilla extract, 1/4 cup sugar, and water in a saucepan over medium heat. While the mixture cooks, crush the strawberries with a potato masher. Simmer the sauce until the sugar has dissolved and the sauce has thickened, about 10 minutes; cool.\nRemove chilled ramekins from the refrigerator shortly before serving. Dip the bottoms of the cups in warm water to help loosen the custard. Run a thin-bladed knife around the inner edge of each ramekin to loosen the dessert; turn onto a dessert plate to unmold. Spoon strawberry sauce over panna cotta to serve.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Cream Puff Dessert",
		"course": "Dessert",
		"totalTime": 120,
		"numberOfServings": 12,
		"ingredients": [
			"PUFF ",
			"1 cup water ",
			"1/2 cup butter ",
			"1 cup all-purpose flour ",
			"4 eggs ",
			"FILLING ",
			"1 (8 ounce) package cream cheese, softened ",
			"3 1/2 cups cold milk ",
			"2 (3.9 ounce) packages instant chocolate pudding mix ",
			"TOPPING ",
			"1 (8 ounce) container frozen whipped topping, thawed ",
			"1/4 cup milk chocolate flavored topping ",
			"1/4 cup caramel topping ",
			"1/3 cup slivered almonds "
		],
		"instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13 inch baking dish.\nIn a medium saucepan over medium heat melt butter in water until bubbly. Dump in flour all at once and stir vigorously until mixture forms a ball. Remove from heat and let stand 5 minutes. Beat in eggs, one at a time, until smooth and glossy. Spread in prepared pan.\nBake in preheated oven 30 to 35 minutes, until puffy and golden. Let cool completely on wire rack.\nWhile puff is cooling, beat together cream cheese, milk and pudding mix. Spread over cooled puff. Chill 20 minutes.\nSpread whipped topping over chilled filling and drizzle with chocolate and caramel sauces. Sprinkle with almonds. Freeze 1 hour before serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Rhubarb Cheesecake Dream Bars",
		"course": "Dessert",
		"totalTime": 95,
		"numberOfServings": 15,
		"ingredients": [
			"1 cup all-purpose flour ",
			"1/2 cup butter, softened ",
			"1 tablespoon white sugar ",
			"1 cup white sugar ",
			"1/4 cup all-purpose flour ",
			"4 cups finely chopped rhubarb ",
			"1 (8 ounce) package cream cheese, softened ",
			"1/2 cup white sugar ",
			"1 egg ",
			"1/2 cup sour cream ",
			"1 tablespoon white sugar "
		],
		"instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease an 11x7-inch baking dish.\nIn a bowl, mix together 1 cup flour, the softened butter, and 1 tablespoon sugar until well combined; press into the bottom of the prepared baking dish.\nBake the crust in the preheated oven until it starts to brown, about 10 minutes. Remove the crust. Reduce oven heat to 350 degrees F (175 degrees C).\nUsing the same bowl, thoroughly mix 1 cup sugar with 1/4 cup flour; stir in the rhubarb and toss to coat. Spread the rhubarb mixture over the baked crust. Using the same bowl, mash the cream cheese, 1/2 cup of sugar, and the egg until the mixture is creamy; spread over the rhubarb.\nBake in the oven until the rhubarb is bubbling and the topping is set, about 35 minutes.\nIn the same bowl, mix sour cream with 1 tablespoon of sugar; spread over the hot dessert. Allow to cool completely before cutting into bars. Refrigerate leftovers.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Pineapple Casserole Dessert",
		"course": "Dessert",
		"totalTime": 75,
		"numberOfServings": 15,
		"ingredients": [
			"1 cup butter ",
			"1 2/3 cups white sugar ",
			"6 eggs ",
			"1 (15 ounce) can crushed pineapple, drained ",
			"9 slices bread, cubed ",
			"1/3 cup shredded Cheddar cheese "
		],
		"instructions": "Preheat oven to 325 degrees F (165 degrees C).\nCream together butter and sugar. Beat in eggs, one at a time, until fully incorporated. Fold in pineapple and bread. Pour into 9x13 inch baking dish.\nBake in preheated oven 1 hour, until center springs back when touched lightly. Sprinkle cheese evenly over top and return to oven to melt cheese, 2 to 5 minutes.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Sticky Date Pudding",
		"course": "Dessert",
		"totalTime": 90,
		"numberOfServings": 12,
		"ingredients": [
			"1 cup flour ",
			"1 teaspoon baking powder ",
			"2 1/2 ounces dark chocolate, grated ",
			"7 ounces chopped pitted dates ",
			"1 1/4 cups water ",
			"1 teaspoon baking soda ",
			"1/4 cup softened butter ",
			"3/4 cup superfine (castor) sugar ",
			"2 eggs ",
			"1 cup heavy cream ",
			"1 cup firmly packed brown sugar ",
			"1 cup butter ",
			"2 tablespoons confectioners' sugar for dusting ",
			"3 cups vanilla ice cream "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 12 cup muffin tin. Whisk together the flour, baking powder, and chocolate in a small bowl, and set aside.\nBring the dates and water to a boil in a saucepan over high heat. Remove from the heat, and stir in the baking soda. Allow the mixture to stand for 5 minutes, then scrape into a blender, and carefully puree until smooth; set aside.\nCream 1/4 cup of butter together with the superfine sugar until light and fluffy. Add the eggs one at a time, beating well between each addition. Fold in the flour mixture and the date puree until well blended. Spoon into the prepared muffin cups.\nBake in the preheated oven for 25 minutes. Meanwhile, stir together the cream, brown sugar, and 1 cup of butter in a saucepan over medium-low heat until the butter melts; set aside.\nWhen the puddings have baked for 25 minutes, remove them from the oven, and cool in the pan for 10 minutes. Remove the puddings from the muffin tin, and place them onto a baking sheet. Spoon 2 tablespoons of the sauce over each pudding, then return to the oven and bake for 5 minutes more.\nTo serve, spoon some of the sauce onto the bottom of a dessert plate, and place a pudding on top. Lightly dust with confectioners' sugar, and top with a 1/4 cup scoop of ice cream. Repeat with the remaining date puddings.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Dessert Nachos",
		"course": "Dessert",
		"totalTime": 10,
		"numberOfServings": 4,
		"ingredients": [
			"1/3 cup peanut butter ",
			"2 tablespoons confectioners' sugar ",
			"1/2 cup chocolate chips ",
			"2 1/2 cups mini round corn tortilla chips ",
			"1/4 cup miniature marshmallows ",
			"1/4 cup sweetened flaked coconut "
		],
		"instructions": "Preheat your oven's broiler.\nCombine the peanut butter and confectioners' sugar in a microwave-safe bowl. Heat the mixture until the peanut butter melts, about 1 minute. Place the chocolate chips in a separate microwave-safe bowl; melt the chips in the microwave, about 1 minute.\nArrange the tortilla chips into an even layer on a baking sheet. Drizzle the peanut butter mixture and the melted chocolate over the chips. Scatter the marshmallows and coconut over the chips.\nPlace under preheated broiler until the marshmallows begin to brown, 2 to 3 minutes. Serve hot.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Simple Creme Brulee Dessert",
		"course": "Dessert",
		"totalTime": 195,
		"numberOfServings": 2,
		"ingredients": [
			"3 tablespoons white sugar ",
			"1 cup heavy cream ",
			"3 egg yolks ",
			"1/4 teaspoon vanilla extract ",
			"2 tablespoons white sugar, divided "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk 3 tablespoons sugar and cream in a microwave-safe bowl until well combined; heat the mixture in microwave until warm, 1 to 2 minutes, and whisk again to dissolve sugar. Whisk in egg yolks and vanilla extract until smooth.\nPour cream mixture into 2 ramekins. Set ramekins into a roasting pan and pour in enough hot water to reach halfway up the sides of the ramekins.\nBake in the preheated oven until creme desserts are set but still slightly jiggly when shaken, about 50 minutes. Remove ramekins from hot water and chill in refrigerator until cold, at least 2 hours.\nSprinkle 1 tablespoon of sugar evenly over the top of each dessert. Use a kitchen torch to lightly toast and melt the sugar topping until brown and bubbly, about 30 seconds. Let the sugar topping cool before serving. To serve, use a spoon to crack the crisp sugar open to reveal the creamy dessert underneath.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Ice Cream Sandwich Dessert",
		"course": "Dessert",
		"totalTime": 80,
		"numberOfServings": 12,
		"ingredients": [
			"22 ice cream sandwiches ",
			"1 (16 ounce) container frozen whipped topping, thawed ",
			"1 (12 ounce) jar caramel ice cream topping ",
			"1 1/2 cups salted peanuts "
		],
		"instructions": "Cut one ice cream sandwich in half. Place one whole and one half sandwich along a short side of a high-sided 9x13-inch casserole dish. Repeat until bottom is covered, alternating the whole and half sandwiches. Spread with half of the whipped topping. Pour caramel on top. Sprinkle with half of the peanuts. Repeat layers with remaining ice cream sandwiches, whipped topping, and peanuts. The pan will be full. Cover and freeze for up to 2 months. Remove from freezer 20 minutes before serving. Cut into squares.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Boston Cream Dessert Cups",
		"course": "Dessert",
		"totalTime": 160,
		"numberOfServings": 24,
		"ingredients": [
			"1 (16 ounce) package refrigerated sugar cookie dough ",
			"2 (8 ounce) packages cream cheese, softened ",
			"1/2 cup sour cream ",
			"1/2 cup white sugar ",
			"1 tablespoon all-purpose flour ",
			"1 tablespoon milk ",
			"2 eggs ",
			"1 (3.5 ounce) package instant vanilla pudding mix ",
			"1 (16 ounce) container prepared chocolate frosting "
		],
		"instructions": "Preheat an oven to 350 degrees F (175 degrees C). Line 24 muffin cups with paper muffin liners. Divide sugar cookie dough into each muffin cup.\nBake in the preheated oven until the cookie dough softens and spreads across the bottom of each muffin cup, 8 to 10 minutes. Remove from oven and set aside.\nBeat the cream cheese, sour cream, sugar, flour, and milk with an electric mixer in a large bowl until smooth. Beat the first egg into the cream cheese mixture until completely blended, then beat in the last egg. Mix in the instant pudding mix until just incorporated. Spoon about 2 tablespoons of the cream cheese filling into each muffin cup. Return muffin cups to the oven and bake until the filling is set, about 25 minutes. Cool in the pans for 30 minutes then remove the desserts.\nRemove the foil cover of the prepared frosting and microwave until softened, about 30 seconds. Stir frosting until smooth, then spread about one tablespoon of frosting onto each dessert cup. Refrigerate until set, about 1 hour.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Cherry Pretzel Squares",
		"course": "Dessert",
		"totalTime": 250,
		"numberOfServings": 12,
		"ingredients": [
			"2 (21 ounce) cans LUCKY LEAF® Regular or Premium Cherry Fruit Filling ",
			"3 cups chopped pretzels ",
			"3/4 cup brown sugar ",
			"1/4 cup butter, melted ",
			"1 (8 ounce) package cream cheese, softened ",
			"1 cup powdered sugar ",
			"1 (8 ounce) container frozen whipped dessert topping, thawed "
		],
		"instructions": "Preheat oven to 350 degrees F.\nIn a medium bowl, combine crushed pretzels, brown sugar and butter. Spread half of this pretzel mixture in bottom of 13x9-inch baking pan. Bake 10 minutes. Cool.\nWhile the pretzel mixture is baking, combine the cream cheese and powdered sugar in large mixing bowl. Fold in whipped topping.\nSpread half of this cream cheese mixture on top of the cooled baked pretzel crust. Spread 2 cans of LUCKY LEAF Cherry Fruit Filling over the cream cheese layer, then spread the remaining half of the cream cheese mixture over the pie filling.\nSprinkle with the remaining pretzel mixture. Refrigerate at least 4 hours.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Om Ali",
		"course": "Dessert",
		"totalTime": 60,
		"numberOfServings": 8,
		"ingredients": [
			"1 (17.5 ounce) package frozen puff pastry sheets, thawed ",
			"1/2 cup chopped walnuts ",
			"1 cup chopped pecans ",
			"1 cup chopped hazelnuts ",
			"1 cup raisins ",
			"1 cup flaked coconut ",
			"1 1/4 cups white sugar, divided ",
			"4 cups milk ",
			"1/2 cup heavy cream "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\nPlace the pastry sheets in the baking dish and place the dish in the oven. Watch it closely. When the top layer turns crunchy and golden, remove it from the oven. Continue until all the sheets are cooked.\nPreheat the oven's broiler.\nIn a bowl, combine walnuts, pecans, hazelnuts, raisins, coconut and 1/4 cup sugar. Break cooked pastry into pieces and stir into nut mixture. Spread mixture evenly in 9x13-inch dish.\nBring milk and 1/2 cup sugar to a boil in a medium saucepan over medium heat. Pour over nut mixture.\nBeat the heavy cream with the remaining 1/2 cup sugar until stiff peaks form. Spread evenly over nut mixture in dish.\nPlace dessert under oven broiler until top is golden brown, about 10 minutes. Serve hot.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Gluten-Free Strawberry Shortcake",
		"course": "Dessert",
		"totalTime": 90,
		"numberOfServings": 8,
		"ingredients": [
			"2/3 cup brown rice flour ",
			"2/3 cup cornstarch ",
			"2/3 cup tapioca flour ",
			"1 tablespoon baking powder ",
			"1/4 teaspoon baking soda ",
			"1/4 teaspoon xanthan gum ",
			"1/2 teaspoon salt ",
			"6 tablespoons vegetable shortening ",
			"2/3 cup white sugar ",
			"3/4 cup skim milk ",
			"4 cups sliced fresh strawberries ",
			"2 cups reduced-fat whipped topping "
		],
		"instructions": "Preheat an oven to 425 degrees F (220 degrees C). Whisk the rice flour, cornstarch, tapioca flour, baking powder, baking soda, xanthan gum, and salt together in a bowl; set aside. Grease a baking sheet, or cover with a sheet of parchment paper.\nBeat the shortening and sugar with an electric mixer in a large bowl until light and fluffy. Pour in the flour mixture alternately with the milk, mixing until just incorporated. Drop onto the prepared baking sheet into 8 equal portions.\nBake in the preheated oven until golden brown on the bottoms, 10 to 12 minutes. Remove, and cool on a wire rack to room temperature.\nOnce cool, slice each shortcake in half, and place each bottom half onto a dessert plate. Evenly divide the sliced strawberries onto each shortcake, and dollop with the whipped topping. Place the shortcake tops on to serve.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Dessert Bars",
		"course": "Dessert",
		"totalTime": 45,
		"numberOfServings": 20,
		"ingredients": [
			"2 cups butter, softened ",
			"2 cups white sugar ",
			"4 egg yolks ",
			"4 cups all-purpose flour ",
			"1 1/2 cups raspberry jam "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a medium bowl, cream together the butter and sugar until light and fluffy. Blend in the egg yolks. Gradually mix in the flour to form a dough. With lightly floured hands, press half of the dough into the bottom of the prepared pan. Spread evenly with raspberry jam. Flatten pieces of the remaining dough and place them over the raspberry layer to cover the top.\nBake for 30 minutes in the preheated oven, until lightly golden. Cool slightly before cutting into bars.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Pistachio Nut Cake II",
		"course": "Dessert",
		"totalTime": 80,
		"numberOfServings": 14,
		"ingredients": [
			"1 (18.25 ounce) package yellow cake mix ",
			"2 (3.4 ounce) packages instant pistachio pudding mix ",
			"1 cup vegetable oil ",
			"3 eggs ",
			"1 cup carbonated water ",
			"1/2 cup chopped pistachio nuts ",
			"1 (1.5 ounce) envelope instant dessert topping ",
			"1 1/2 cups milk "
		],
		"instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a medium bowl, stir together the cake mix and 1 package of instant pudding. Add the oil, eggs and club soda, mix well. Fold in the chopped nuts, reserving some for garnish if desired. Pour into the prepared pan.\nBake for 50 to 60 minutes in the preheated oven, until cake springs back when lightly touched. Cool for 10 minutes in the pan before inverting onto a wire rack to cool completely. In a medium bowl, stir together the instant whipped topping and instant pudding. Add the milk and mix until light and fluffy. Slice cooled cake into layers, fill and frost including the hole in the middle. Garnish with nuts if desired. Keep chilled until serving.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Mom's Ice Cream Dessert",
		"course": "Dessert",
		"totalTime": 150,
		"numberOfServings": 24,
		"ingredients": [
			"1 (20 ounce) package chocolate sandwich cookies ",
			"1/2 cup margarine, melted ",
			"1 1/2 cups chopped Spanish peanuts ",
			"1/2 gallon vanilla ice cream, softened ",
			"2 cups confectioners' sugar ",
			"1 (12 fluid ounce) can evaporated milk ",
			"2/3 cup semisweet chocolate chips ",
			"1/2 cup margarine ",
			"1 teaspoon vanilla extract "
		],
		"instructions": "Crush all but 10 of the cookies. Combine crushed cookies in large bowl with melted margarine and peanuts. Press mixture into a 9x13 inch baking dish and freeze until cold.\nSpread softened ice cream over cold crust and freeze until set.\nCombine confectioners' sugar, evaporated milk, chocolate chips, 1/2 cup margarine and vanilla in large saucepan and bring to a boil over medium heat. Boil for 7 minutes, stirring constantly.\nRemove from heat and cool completely; pour mixture over ice cream and freeze until set.\n",
		"pictureLink": "resources/static/images"
	},
	{
		"title": "Zabaglione",
		"course": "Dessert",
		"totalTime": 35,
		"numberOfServings": 4,
		"ingredients": [
			"5 egg yolks ",
			"1/2 cup white sugar ",
			"6 tablespoons Marsala wine ",
			"2 pints fresh raspberries (optional) "
		],
		"instructions": "In top of a double boiler over simmering water, mix together egg yolks and sugar until sugar has dissolved. Stir in Marsala.\nWhisk mixture until it is thick and foamy; continue cooking, whisking constantly, until mixture is thick and very hot to the touch. Remove from heat and serve immediately over fresh berries in dessert bowls or wine glasses.\n",
		"pictureLink": "resources/static/images"
	},

{
    "title": "Gobble Up Granola Snacks",
	"course": "Snack",
	"totalTime": 45,
	"numberOfServings": 18,
    "ingredients": [
      "2 1/2 cups crispy rice cereal ",
      "2 cups quick-cooking oats ",
      "1/2 cup raisins ",
      "1/2 cup packed brown sugar ",
      "1/2 cup light corn syrup ",
      "1/2 cup crunchy peanut butter ",
      "1 teaspoon vanilla extract "
    ],
    "instructions": "In a large bowl, stir together the rice cereal, oats, and raisins. Set aside. Grease a 9x13 inch baking dish with cooking spray.\nCombine the brown sugar and corn syrup in a small saucepan over medium heat. Heat just until boiling, then remove from heat and stir in peanut butter and vanilla until smooth. Pour over the cereal and oat mixture, and mix well.\nPress into the prepared pan using the back of a large spoon. Allow to cool, then cut into squares.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Pecan Snack",
	"course": "Snack",
	"totalTime": 70,
	"numberOfServings": 32,
    "ingredients": [
      "1 egg white ",
      "1 tablespoon water ",
      "1 pound pecans ",
      "3/4 cup white sugar ",
      "1 teaspoon ground cinnamon ",
      "1 teaspoon salt "
    ],
    "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nIn a large bowl, beat egg white with water until frothy. Stir in pecans and mix to coat. Combine sugar, cinnamon and salt and stir into pecan mixture. Spread on a baking sheet.\nBake in preheated oven 1 hour, stirring every 15 minutes. Store in an airtight container.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "White Chocolate Snack Mix",
	"course": "Snack",
	"totalTime": 25,
	"numberOfServings": 40,
    "ingredients": [
      "1 (10 ounce) package mini twist pretzels ",
      "5 cups toasted oat cereal ",
      "5 cups crispy corn cereal squares ",
      "2 cups salted peanuts ",
      "1 (14 ounce) package candy-coated milk chocolate pieces ",
      "2 (11 ounce) packages white chocolate chips ",
      "3 tablespoons vegetable oil "
    ],
    "instructions": "Line 3 baking sheets with waxed paper or parchment. Set aside.\nIn a large bowl, combine mini pretzels, toasted oat cereal, crispy corn cereal squares, salted peanuts, and candy-coated chocolate pieces. Set aside.\nIn a microwave-safe bowl, heat chips and oil on medium-high for 2 minutes, stirring once. Microwave on high for 10 seconds; stir until smooth. Pour over cereal mixture and mix well.\nSpread onto prepared baking sheets. Cool; break apart. Store in an airtight container.\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "Won Ton Snacks",
	"course": "Snack",
	"totalTime": 35,
	"numberOfServings": 48,
    "ingredients": [
      "2 pounds ground pork ",
      "2 stalks celery ",
      "2 carrots ",
      "2 cloves garlic ",
      "1 small onion ",
      "1 (8 ounce) can water chestnuts ",
      "1/2 cup prepared Thai peanut sauce ",
      "1 (14 ounce) package round wonton wrappers "
    ],
    "instructions": "In a food processor, finely chop the celery, carrots, garlic, onion, and water chestnuts. The pieces should be small and fairly uniform, but not liquid.\nIn a large skillet, combine the ground pork and chopped vegetables. Cook over medium heat until the vegetables are soft, and the pork is no longer pink. Increase the heat to high, and let the moisture evaporate, then stir in peanut sauce and cook for 5 more minutes before removing from heat.\nWhile the pork mixture is cooking, preheat the oven to 350 degrees F (175 degrees C). Press one wonton wrap into each cup of a mini muffin pan, with the edges flared out to the sides. Place one scoop of the meat mixture into each cup.\nBake for about 12 minutes in the preheated oven, or until the outer wrappers are crisp and golden. Allow to cool slightly in the pan before removing to a serving tray.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Snicky Snackies",
	"course": "Snack",
	"totalTime": 40,
	"numberOfServings": 20,
    "ingredients": [
      "15 ounces mini twist pretzels ",
      "2 cups mixed nuts ",
      "1 cup unsalted butter ",
      "2 cups packed dark brown sugar ",
      "1/2 cup light corn syrup ",
      "1 pinch salt "
    ],
    "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nIn a 9x13-inch baking dish, combine the pretzels and nuts. Set aside.\nIn a large saucepan combine the butter, sugar, corn syrup and salt. Stir together over medium heat until sugar dissolves. Bring to a boil and cook until very thick and at the 'firm ball' stage (260 degrees F, 125 degrees C). Remove from heat, pour over pretzel/nut mixture and mix all together.\nBake in the preheated oven for 20 minutes, stirring after 10 minutes. Remove from oven and spread out on wax paper to cool.\n",
    "pictureLink": "resources/static/images"
  },
    {
    "title": "Caramel Corn Snack Mix",
	"course": "Snack",
	"totalTime": 55,
	"numberOfServings": 15,
    "ingredients": [
      "8 cups popped popcorn ",
      "4 cups crispy rice cereal squares ",
      "2 cups small pretzel twists ",
      "1 cup pecan halves ",
      "1 cup packed brown sugar ",
      "1/2 cup butter ",
      "1/4 cup light corn syrup ",
      "1 teaspoon vanilla extract ",
      "1/2 teaspoon baking soda "
    ],
    "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nIn a large bowl, combine the popcorn, cereal, pretzels and pecans.\nIn a saucepan over medium heat, combine the brown sugar, butter and corn syrup. Cook and stir until mixture comes to a boil. Reduce heat to medium low; cook without stirring for 5 minutes.\nRemove saucepan from heat and stir in vanilla and baking soda. Pour over popcorn mixture and toss until evenly coated.\nBake at 300 degrees F (150 degrees F) for 30 minutes, stirring after 15 minutes. Transfer to large piece of parchment paper and cool completely. Break into chunks once cool.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Banana Snack Cake",
	"course": "Snack",
	"totalTime": 65,
	"numberOfServings": 24,
    "ingredients": [
      "1 cup white sugar ",
      "1 cup butter ",
      "2 eggs ",
      "1/2 cup buttermilk ",
      "1 cup mashed bananas ",
      "1 teaspoon vanilla extract ",
      "2 cups all-purpose flour ",
      "1 cup quick cooking oats ",
      "1 1/2 teaspoons baking soda ",
      "1 teaspoon salt ",
      "1/2 cup chopped walnuts ",
      "1/2 cup flaked coconut ",
      "2 cups semisweet chocolate chips "
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. In a medium bowl, mix flour, oats, baking soda and salt together and set aside.\nIn a large bowl, cream butter and sugar until light and fluffy. Add eggs one at a time, mixing well with each addition. Mix in buttermilk, bananas and vanilla. Add flour mixture and mix well. Finally, fold in the nuts, coconut and 1 cup of the chocolate chips.\nPour batter into a 9x13 inch pan. Sprinkle top with remaining 1 cup of chocolate chips. Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes, or until a toothpick inserted into the cake comes out clean.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Snack Crackers",
	"course": "Snack",
	"totalTime": 65,
	"numberOfServings": 12,
    "ingredients": [
      "1 (1 ounce) package ranch dressing mix ",
      "1 teaspoon garlic powder ",
      "1/2 teaspoon dried dill weed ",
      "1/2 cup vegetable oil ",
      "1 (12 ounce) package oyster crackers "
    ],
    "instructions": "Mix together ranch dressing mix, garlic powder, dill and vegetable oil. Add crackers and mix gently until the crackers are coated with the mixture. Stir every 10 minutes for 1 hour. Store in an airtight jar.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Raisin' the Dead Snack Mix",
	"course": "Snack",
	"totalTime": 15,
	"numberOfServings": 64,
    "ingredients": [
      "1 pound yogurt covered raisins ",
      "1 pound salted cashews ",
      "1 (14 ounce) package chocolate covered peanuts ",
      "1 pound white chocolate covered pretzels, broken into pieces ",
      "1 pound candy corn ",
      "1 pound semisweet chocolate chips ",
      "2 pounds candy-coated chocolate pieces "
    ],
    "instructions": "In a large bowl, combine the yogurt covered raisins, cashews, chocolate covered peanuts, pretzels, candy corn, chocolate chips and chocolate candies. Mix to distribute evenly and store in an airtight container.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Shawn's Study Snacks",
	"course": "Snack",
	"totalTime": 15,
	"numberOfServings": 60,
    "ingredients": [
      "3 bananas, mashed ",
      "3/4 cup butter ",
      "1 egg ",
      "1 cup white sugar ",
      "1/4 cup packed brown sugar ",
      "1 teaspoon baking soda ",
      "2 1/2 cups all-purpose flour ",
      "1/4 teaspoon ground nutmeg ",
      "1/2 teaspoon ground cinnamon ",
      "1 1/2 cups rolled oats ",
      "3/4 cup chopped walnuts ",
      "1/2 cup raisins (optional) "
    ],
    "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together in order given, making sure that butter or margarine is well beaten in. You can add up to 1/2 teaspoon more of cinnamon if you like spice. More flour may be added if batter is runny.\nDrop by tablespoonfuls on greased baking sheet. Bake for 10 minutes or until edges are slightly brown. Cookies with be soft.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Game Day Sausage Snacks",
	"course": "Snack",
	"totalTime": 20,
	"numberOfServings": 15,
    "ingredients": [
      "12 ounces ground pork sausage ",
      "12 ounces spicy ground pork sausage ",
      "1 (16 ounce) jar processed cheese sauce ",
      "1 (1 pound) loaf sliced pumpernickel party bread "
    ],
    "instructions": "Preheat the broiler.\nPlace ground pork sausage and spicy ground pork sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain sausage. Mix in processed cheese sauce. Arrange pumpernickel party bread slices in a single layer on a medium baking sheet. Place even amounts of the sausage mixture on each slice.\nBroil the bread slices 3 to 5 minutes, checking frequently, until toasted.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Reindeer Snack Mix",
	"course": "Snack",
	"totalTime": 75,
	"numberOfServings": 18,
    "ingredients": [
      "2 cups cone-shaped corn snacks (such as Bugles®) ",
      "2 cups cheese-flavored crackers (such as Cheez-It®) ",
      "2 cups small pretzels ",
      "1 cup crispy corn cereal squares (such as Corn Chex®) ",
      "1 cup mini shredded wheat cereal squares (optional) ",
      "1 cup pecan halves ",
      "1/2 cup butter, melted ",
      "1 tablespoon maple syrup ",
      "1 1/2 teaspoons Worcestershire sauce ",
      "3/4 teaspoon Cajun seasoning ",
      "1/4 teaspoon cayenne pepper "
    ],
    "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nCombine cone-shaped corn snacks, cheese crackers, pretzels, corn cereal squares, mini shredded wheat squares, and pecan halves in a large bowl. Whisk butter, maple syrup, Worcestershire sauce, Cajun seasoning, and cayenne pepper in a separate bowl. Pour butter mixture over snack mixture and toss lightly to coat. Spread mixture into a 10x15-inch jelly roll pan.\nBake in the preheated oven until snacks are lightly toasted and liquid has been absorbed, about 1 hour; stir every 15 minutes.\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "Peanut Butter Snack Bars",
	"course": "Snack",
	"totalTime": 60,
	"numberOfServings": 24,
    "ingredients": [
      "parchment paper ",
      "cooking spray ",
      "3/4 cup chopped dark chocolate ",
      "2 cups rolled oats ",
      "1/4 cup wheat germ ",
      "1/4 cup flax seeds ",
      "1 cup crispy rice cereal ",
      "1 cup cornflake crumbs ",
      "3/4 cup chopped smoke-flavored almonds ",
      "1/2 teaspoon kosher salt ",
      "1/2 cup honey ",
      "1/2 cup creamy peanut butter ",
      "1/4 cup brown sugar ",
      "2 tablespoons agave nectar ",
      "1 tablespoon canola oil ",
      "1/4 teaspoon ground cinnamon ",
      "1 teaspoon vanilla extract "
    ],
    "instructions": "Line a 9x13-inch baking dish with parchment paper and spray with cooking spray. Spread chocolate evenly over prepared baking dish.\nToast oats, wheat germ, and flax seed in a non-stick skillet over medium heat, stirring frequently until oats are lightly golden and fragrant, about 5 minutes. Transfer oat mixture to a large bowl and stir in crispy rice cereal, cornflake crumbs, almonds, and salt.\nHeat honey, peanut butter, brown sugar, agave nectar, canola oil, and cinnamon in a saucepan over medium heat. Cook and stir until mixture begins to bubble, 3 to 5 minutes. Remove from heat and stir in vanilla extract. Pour peanut butter mixture over cereal mixture; gently stir until well mixed.\nSpread peanut butter-cereal mixture into the baking dish. Place another sheet of parchment over the mixture and firmly press into the dish until even. Allow to completely cool before removing from baking dish and slicing.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Cucumber Crab Snacks",
	"course": "Snack",
	"totalTime": 15,
	"numberOfServings": 8,
    "ingredients": [
      "1 large cucumber, cut into 1/4-inch slices ",
      "1 (8 ounce) package whipped cream cheese ",
      "2 (6 ounce) cans crabmeat, drained and flaked ",
      "1 (8 ounce) jar cocktail sauce "
    ],
    "instructions": "Spread each cucumber slice with cream cheese, layer with crabmeat, and top with cocktail sauce. Place in the refrigerator to chill, or serve right away.\n",
    "pictureLink": "resources/static/images"
  },
    {
    "title": "Raw Food Snacks - Cinnamon Bun Balls",
	"course": "Snack",
	"totalTime": 10,
	"numberOfServings": 10,
    "ingredients": [
      "1/2 cup walnuts ",
      "5 Medjool dates, pitted ",
      "3 tablespoons ground cinnamon ",
      "1 teaspoon ground cardamom ",
      "1 tablespoon finely chopped walnuts, or to taste "
    ],
    "instructions": "Blend 1/2 cup walnuts, dates, cinnamon, and cardamom together in a blender until almost smooth. Roll mixture into little balls. Place finely chopped walnuts in a shallow bowl and roll balls in walnuts to coat. Store balls in refrigerator.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Pile High Snack Stadium",
	"course": "Snack",
	"totalTime": 240,
	"numberOfServings": 200,
    "ingredients": [
      "400 slices bread ",
      "200 slices Cheddar cheese ",
      "400 slices thinly sliced ham ",
      "23 ounces salsa con queso (such as Tostitos®), divided ",
      "1 tablespoon chile-garlic sauce (such as Sriracha) ",
      "1 tablespoon sour cream ",
      "1 (16 ounce) jar tomatillo salsa, or as needed ",
      "1/2 cup sour cream ",
      "2 pounds Cheddar cheese, divided ",
      "4 pepperoni beef sticks (such as Slim Jim®) ",
      "8 toothpicks, or as needed ",
      "4 (10 ounce) containers hummus, or as needed ",
      "4 (10 ounce) containers red pepper hummus, or as needed ",
      "14 cardboard magazine holders ",
      "duct tape as needed ",
      "8 pounds baby carrots ",
      "5 pounds broccoli florets ",
      "4 (16 ounce) packages cheese-flavored crackers (such as Cheez-It®) ",
      "4 (12 ounce) packages blue corn tortilla chips ",
      "2 (13 ounce) packages ridged potato chips (such as Ruffles®) ",
      "2 (6 ounce) packages pita chips ",
      "8 sleeves buttery round crackers (such as Ritz®) ",
      "20 (10 inch) skewers ",
      "2 (13.5 ounce) packages nacho cheese-flavored tortilla chips (such as Doritos®) ",
      "2 (13 ounce) packages crunchy cheese puffs (such as Cheetos®) ",
      "2 (10.5 ounce) bags corn chips (such as Fritos®) "
    ],
    "instructions": "Place a slice of bread on a work surface; top with 1 slice Cheddar cheese and 3 slices ham. Cover with a second slice of bread to create a sandwich. Repeat with remaining bread slices, Cheddar cheese, and ham.\nPour salsa con queso into a 3-inch bowl representing the center field logo. Draw a logo atop the salsa con queso using chile-garlic sauce and 1 tablespoon sour cream. Place bowl in the center of a 9x13-inch baking dish.\nSpread tomatillo salsa into the bottom of the 9x13-inch baking dish and around the center field 'logo' for the 'field'. Fill a piping bag with 1/2 cup sour cream. Pipe 9 lines of sour cream onto the 'field' representing 10-yard lines.\nCut two 3-inch pieces of Cheddar cheese representing the base of the goal post. Cut pepperoni sticks into two 3-inch pieces, two 2-inch pieces, and four 1-inch pieces. Secure each 3-inch piece of pepperoni stick to each Cheddar cheese piece using a toothpick. Secure the 2-inch pieces of pepperoni stick horizontally to the 3-inch pieces using a toothpick. Secure the 1-inch pieces of pepperoni sticks as the sides of the goal post using toothpicks.\nPlace each goal post into the center of a 9x5-inch loaf pan. Spread hummus around goal post representing 1 end zone. Spread red pepper hummus into the other 9x5-inch loaf pan representing the other end zone.\nCover a table with a clean disposable table cloth. Arrange the 'field' in the center of the table. Place 'end zones' on either end of 'field'. Secure 2 sets of 5 and 2 set of 2 magazine holders together using duct tape for the 'seating sections'; arrange around the 'field'.\nFill the 'seating sections' with carrots, broccoli, cheese crackers, blue corn tortilla chips, potato chips, pita chips, and buttery round crackers.\nArrange the sandwiches around the 'seating sections' using a brick-layer pattern.\nMake 12 'flags' by cutting 1-inch triangles from the Cheddar cheese. Secure each 'flag' to a skewer. Pierce the flag skewers through sandwich 'walls' around the 'stadium'. Make 4 'stadium lights' by cutting 2x1-inch rectangles out of Cheddar cheese. Secure each 'light' to 2 skewers. Pierce the light skewers around the 4 corners of the 'stadium'.\nFill the corners of the 'stadium' with nacho-flavored tortilla chips, crunchy cheese puffs, and corn chips.\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "Bold and Simple Snack Mix",
	"course": "Snack",
	"totalTime": 60,
	"numberOfServings": 12,
    "ingredients": [
      "1 (12 ounce) package crispy corn and rice cereal (such as Crispix®) ",
      "6 tablespoons butter ",
      "1/4 cup Worcestershire sauce ",
      "1 tablespoon seasoned salt ",
      "1 1/2 teaspoons garlic powder ",
      "1 teaspoon onion powder ",
      "1 pinch cayenne pepper, or to taste ",
      "1 dash jalapeno pepper sauce (such as Tabasco®) "
    ],
    "instructions": "Preheat oven to 250 degrees F (120 degrees C). Pour cereal into a large roasting pan.\nMelt butter in a saucepan over medium-low heat; stir in Worcestershire sauce, seasoned salt, garlic powder, onion powder, cayenne pepper, and jalapeno pepper sauce. Drizzle sauce over cereal and stir to coat evenly.\nBake in the preheated oven, stirring every 15 minutes, until sauce is baked into cereal, about 45 minutes. Cool in pan, about 10 minutes.\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "Furikake Snack Mix",
	"course": "Snack",
	"totalTime": 105,
	"numberOfServings": 20,
    "ingredients": [
      "1/2 cup butter ",
      "1/2 cup white sugar ",
      "1/2 cup corn oil ",
      "1/2 cup light corn syrup (such as Karo®) ",
      "2 (12 ounce) packages crispy corn and rice cereal (such as Crispix®) ",
      "1 (1.9 ounce) container aji nori furikake (seasoned seaweed and sesame rice topping) "
    ],
    "instructions": "Preheat oven to 225 degrees F (110 degrees C).\nMelt the butter and sugar together in a small sauce pan over low heat. Remove from heat, then stir in the corn oil and corn syrup. Place the cereal on a large baking sheet. Pour the butter mixture over the cereal, then sprinkle the furikake while tossing the cereal to coat.\nBake in the preheated oven until the cereal is dry, stirring every 15 minutes to keep cereal from browning too quickly. Allow to cool, then store in an airtight container.\n",
    "pictureLink": "resources/static/images"
  },
{
    "title": "Heart-y Antioxidant Almond Snack Mix",
	"course": "Snack",
	"totalTime": 30,
	"numberOfServings": 18,
    "ingredients": [
      "3 cups multi-grain cereal squares, such as Chex® brand ",
      "3 cups fiber cereal twigs, such as Fiber One® brand ",
      "1 cup sweetened dried cranberries ",
      "3/4 cup dark chocolate morsels ",
      "3/4 cup almond butter ",
      "1/2 cup enriched margarine spread, such as Smart Balance® brand (may use butter) ",
      "3/4 cup almond flour ",
      "1/4 cup sliced almonds ",
      "3/4 cup confectioners' sugar "
    ],
    "instructions": "Line a large sheet pan with waxed paper. Place cereal and dried cranberries in a large resealable plastic bag. In a microwavable bowl, add chocolate chips, almond butter and enriched margarine spread (or butter). Microwave on High heat, uncovered, for 1 minute. Stir. Microwave for another 30 seconds; remove and stir until smooth.\nPour chocolate mixture into plastic bag, seal and shake to coat evenly. Add almond flour, sliced almonds and confectioners sugar. Reseal and shake to coat. Spread mixture on waxed paper and cool completely. Refrigerate in an airtight container; mix can be stored for up to 1 week.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Beer Cheese Dip from Snack Factory®",
	"course": "Snack",
	"totalTime": 45,
	"numberOfServings": 12,
    "ingredients": [
      "8 ounces shredded Cheddar cheese ",
      "6 ounces cream cheese, softened ",
      "2 cloves garlic, diced ",
      "1/2 cup beer ",
      "2 teaspoons cornstarch ",
      "Paprika ",
      "1 (7.2 ounce) package Original Snack Factory® Pretzel Crisps® "
    ],
    "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly spray a glass baking dish with non-stick cooking spray.\nPlace shredded cheese, softened cream cheese, garlic cloves, and beer in a food processor. Process until combined and smooth. Add cornstarch and a dash of paprika; process a little more to combine. Spread mixture in prepared baking dish.\nBake in preheated oven until bubbling, about 35 minutes. Serve with Snack Factory(R) Pretzel Crisps(R).\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "Sweet and Crunchy Popcorn Snack Mix",
	"course": "Snack",
	"totalTime": 50,
	"numberOfServings": 20,
    "ingredients": [
      "waxed paper ",
      "2 cups crispy corn and rice cereal (such as Crispix®) ",
      "2 cups honey graham cereal (such as Golden Grahams®) ",
      "2 cups peanut butter corn puff cereal (such as Reese's Puffs®) ",
      "2 cups popped popcorn, or more to taste (optional) ",
      "8 ounces candy-coated milk chocolate pieces (such as M&M;'s®) ",
      "1 cup salted peanuts ",
      "1/2 cup butter ",
      "2 tablespoons all-purpose flour ",
      "1 cup brown sugar ",
      "1/2 cup corn syrup ",
      "1/2 cup peanut butter "
    ],
    "instructions": "Line a large baking sheet with waxed paper.\nCombine crispy corn and rice cereal, honey graham cereal, peanut butter corn puff cereal, popcorn, chocolate pieces, and peanuts in a large bowl.\nMelt butter in a large saucepan over medium heat; whisk in flour until smooth, 2 to 3 minutes. Add brown sugar and corn syrup; bring to a boil, stirring occasionally, until sugar is dissolved, about 1 minute. Stir peanut butter into sugar mixture until creamy, about 3 minutes; pour over cereal mixture and gently toss until coated.\nSpread cereal mixture over prepared baking sheet and allow to cool, about 30 minutes. Once cooled, break mixture into chunks and store in an airtight container.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Awesome Grilled Walleye (Scooby Snacks)",
	"course": "Snack",
	"totalTime": 25,
	"numberOfServings": 2,
    "ingredients": [
      "1 pound walleye fillets ",
      "2 12x12-inch squares aluminum foil ",
      "5 tablespoons butter, melted ",
      "1 pinch seasoned salt, or to taste ",
      "1 pinch garlic and herb seasoning blend (such as Mrs. Dash®), or to taste "
    ],
    "instructions": "Preheat an outdoor grill for medium-high heat.\nPlace walleye, skin-side down, in the center of one aluminum foil square. Brush fillet with butter; season with seasoned salt and garlic and herb seasoning blend. Place second aluminum foil square over the fish and fold edges of the two pieces of foil together to form a secure packet.\nCook on the preheated grill until fish flakes easily with a fork, about 7 minutes per side.\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "Sesame Stick Snacks",
	"course": "Snack",
	"totalTime": 30,
	"numberOfServings": 10,
    "ingredients": [
      "2 cups biscuit baking mix ",
      "2/3 cup heavy cream ",
      "1/4 cup butter, melted ",
      "1 1/2 tablespoons sesame seeds "
    ],
    "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease 2 baking sheets.\nStir together baking mix and cream; blend for 30 seconds. Turn dough out onto a lightly flour surface and knead 10 times. Roll dough into a 5x10 inch rectangle. Cut dough into 1/2 inch wide strips.\nPlace strips on prepared baking sheets. Brush strips with melted butter and sprinkle with sesame seeds.\nBake in preheated oven for 15 minutes, until golden.\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "German Chocolate Snacking Bars",
	"course": "Snack",
	"totalTime": 40,
	"numberOfServings": 18,
    "ingredients": [
      "4 (1 ounce) squares German sweet chocolate ",
      "1/4 cup butter ",
      "1 (14 ounce) can sweetened condensed milk ",
      "2 eggs ",
      "1/2 cup baking mix ",
      "1 teaspoon vanilla extract ",
      "1 (8 ounce) package flaked coconut ",
      "1 cup chopped pecans "
    ],
    "instructions": "In a medium saucepan, melt chocolate and butter or margarine over low heat. Remove pan from heat.\nStir 1/2 cup sweetened condensed milk, eggs, biscuit mix, and vanilla into chocolate mixture.\nSpread batter evenly into a greased 13 x 9 inch baking dish.\nIn a medium bowl, combine the remaining condensed milk with the coconut; spoon evenly over batter in baking dish. Sprinkle nuts over the top; press them down firmly.\nHeat oven to 325 degrees F (165 degrees C). Bake for 25 minutes, or until done. Cool and cut into bars.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Crunchy Chocolate Chip Peanut Butter Snack Bites",
	"course": "Snack",
	"totalTime": 40,
	"numberOfServings": 10,
    "ingredients": [
      "1 cup large flake rolled oats ",
      "1/2 cup KRAFT Crunchy Peanut Butter ",
      "1/4 cup honey ",
      "1/2 cup salted peanuts, chopped ",
      "1/2 cup BAKER'S Semi-Sweet Chocolate Chips "
    ],
    "instructions": "Mix together all ingredients in a medium bowl until blended. Refrigerate for 20 to 30 min.\nRoll into 20 (1-inch) balls, using about 2 Tbsp. for each.\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "Bacon, Herb and Cheese Snack Bread",
	"course": "Snack",
	"totalTime": 75,
	"numberOfServings": 12,
    "ingredients": [
      "4 1/2 cups all-purpose flour ",
      "2 envelopes Fleischmann's® RapidRise Yeast ",
      "1 1/2 teaspoons Spice Islands® Italian Herb Seasoning ",
      "1 1/4 teaspoons salt ",
      "1 clove garlic, minced ",
      "1 1/4 cups water ",
      "1/4 cup Mazola® Vegetable Plus! Oil ",
      "2 eggs ",
      "8 ounces shredded cheese blend (Cheddar Jack, Cheddar mozzarella, etc.) ",
      "6 slices cooked bacon, coarsely chopped "
    ],
    "instructions": "Combine 1-1/2 cups flour, undissolved yeast, Italian herb seasoning, salt and garlic in a large mixer bowl. Heat water and oil until very warm (120 degrees to 130 degrees F); gradually add to flour mixture. Beat 2 minutes at medium speed of electric mixer, scraping bowl occasionally. Add eggs and 1 cup flour; beat 2 minutes at high speed. Stir in 1 cup cheese and remaining flour to make a stiff batter. Spread batter on greased 15 x 10-inch jelly roll pan or rimmed baking sheet with at least 1-inch sides. Sprinkle with remaining cheese; top with bacon. Cover; let rise in warm, draft-free place until doubled in size, about 30 minutes.\nBake at 375 degrees F for 25 to 30 minutes or until done. Cover loosely with foil during last 5 to 10 minutes of baking if cheese begins to overbrown. Remove from pan; cool on wire rack. Serve as strips or squares, or slice and use for sandwiches.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Snacks' Crazy Sweet Corn Pudding",
	"course": "Snack",
	"totalTime": 180,
	"numberOfServings": 8,
    "ingredients": [
      "1/4 pound margarine ",
      "1/4 cup white sugar ",
      "3 eggs ",
      "1 (8 ounce) container reduced-fat sour cream ",
      "1 1/2 teaspoons vanilla extract ",
      "1/4 teaspoon ground nutmeg ",
      "1 1/2 teaspoons ground cinnamon ",
      "1/4 tablespoon ground cloves ",
      "1 (8.5 ounce) package dry corn muffin mix ",
      "1/4 cup milk ",
      "1 (15 ounce) can cream-style corn ",
      "1 (15.25 ounce) can sweet corn, drained "
    ],
    "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Lightly grease a baking dish.\nBeat the margarine and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the sour cream, vanilla, nutmeg, cinnamon, and cloves. Pour in the corn muffin mix alternately with the milk, mixing until just incorporated. Fold in the cream-style corn and sweet corn; mixing just enough to evenly combine. Pour the batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 45 minutes to 1 hour. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
    "pictureLink": "resources/static/images"
  },
   {
    "title": "Kerri's Concoction Sweet Snack Mix",
	"course": "Snack",
	"totalTime": 115,
	"numberOfServings": 32,
    "ingredients": [
      "1/2 cup butter ",
      "3 tablespoons brown sugar ",
      "1 1/2 teaspoons ground cinnamon ",
      "1 teaspoon ground ginger ",
      "1/2 teaspoon ground nutmeg ",
      "4 cups toasted oat cereal (such as Cheerios®) ",
      "4 cups shredded wheat cereal biscuits ",
      "4 cups crispy rice cereal squares (such as Rice Chex®) ",
      "2 cups mini pretzels ",
      "2 cups mixed nuts ",
      "1 (6 ounce) package dried cranberries ",
      "1 (12 ounce) package white chocolate morsels "
    ],
    "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nMelt butter in large roasting pan over medium heat. Stir brown sugar, cinnamon, ginger, and nutmeg into the melted butter. Add toasted oat cereal, shredded wheat biscuits, rice cereal squares, pretzels, and nuts; stir to coat with the butter mixture.\nBake in preheated oven, stirring every 15 minutes, for 1 hour. Set aside to cool; transfer to a large bowl.\nFold white chocolate morsels and dried cranberries through the cereal mixture; spread onto a large sheet of waxed paper to cool completely.\n",
    "pictureLink": "resources/static/images"
  },
  {
    "title": "Halloween Party Kiddie Pudding Snack",
	"course": "Snack",
	"totalTime": 15,
	"numberOfServings": 5,
    "ingredients": [
      "5 cups chocolate pudding ",
      "3 cups whipped cream (such as Reddi-Whip®) ",
      "15 gummy worm candies, or to taste ",
      "15 scoops chocolate ice cream (optional) ",
      "2 1/2 cups orange and black sprinkles "
    ],
    "instructions": "Stir chocolate pudding and whipped cream together in a bowl. Add about 10 gummy worms.\nDivide chocolate ice cream between 5 bowls. Spoon chocolate pudding over ice cream and top each with sprinkles and remaining gummy worms.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Horsey Beef Pretzel Bites",
	"course": "Snack",
	"totalTime": 10,
	"numberOfServings": 12,
    "ingredients": [
      "24 Original Snack Factory® Pretzel Crisps® ",
      "8 ounces thinly sliced deli roast beef, cut or torn into bite-size pieces ",
      "8 ounces sliced smoked mozzarella cheese, cut into 24 pieces ",
      "1/4 cup thinly sliced red onion ",
      "2 tablespoons prepared horseradish ",
      "1 tablespoon chopped fresh chives (optional) "
    ],
    "instructions": "Arrange Pretzel Crisps(R) onto a large tray. Top with roast beef and a piece of mozzarella cheese. Add a slice or 2 of red onion. Put a dollop (about 1/4 teaspoon) of horseradish on the onion. Garnish with chives.\n",
    "pictureLink": "resources/static/images"
  },
    {
    "title": "Spicy Avocado Snack",
	"course": "Snack",
	"totalTime": 10,
	"numberOfServings": 2,
    "ingredients": [
      "1 cup ripe avocado, halved and pitted ",
      "1/2 lemon, juiced ",
      "2 tablespoons hot sauce (such as Valentina®), or to taste ",
      "2 pinches kosher salt "
    ],
    "instructions": "Slice the meat of each avocado half 3 or 4 times in one direction, turn avocado and slice 3 or 4 more slices perpendicular to the first slices creating 8 to 12 small cubes still attached to the peel.\nDrizzle lemon juice over each avocado and top with kosher salt. Drizzle hot sauce over each. Eat with a fork or spoon.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Raw Food Snacks - Marzipan!",
	"course": "Snack",
	"totalTime": 10,
	"numberOfServings": 5,
    "ingredients": [
      "7 tablespoons agave nectar ",
      "2 tablespoons firmly packed baby spinach leaves ",
      "2 1/2 cups almond flour, or more as needed "
    ],
    "instructions": "Combine agave nectar and spinach leaves in a bowl; puree with an immersion blender until mixture is smooth. Add almond flour and knead with your hands, adding more almond flour as necessary, until you have a firm dough.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Crunchy Mung Bean Snack",
	"course": "Snack",
	"totalTime": 75,
	"numberOfServings": 2,
    "ingredients": [
      "1 cup dried mung beans ",
      "1/4 cup vegetable oil, or more as needed ",
      "1 green onion, sliced ",
      "1 Thai chile pepper, or more to taste, sliced (optional) ",
      "1 pinch salt "
    ],
    "instructions": "Put mung beans into a large container and cover with several inches of cool water. Soak beans for 1 hour.\nDrain mung beans and spread them out onto a flat surface. Pat gently with paper towel to blot some of the water; air-dry beans for 15 minutes.\nHeat oil in a skillet over medium heat. Cook and stir beans in hot oil until evenly browned and crunchy, about 5 minutes. Drain beans and transfer to a mixing bowl; add chile pepper, green onion, and salt and stir to coat.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Cheesy Asparagus Snack",
	"course": "Snack",
	"totalTime": 25,
	"numberOfServings": 2,
    "ingredients": [
      "6 asparagus spears, ends trimmed, cut into 1-inch pieces ",
      "1/2 cup mayonnaise ",
      "2 tablespoons grated Parmesan cheese ",
      "1/4 teaspoon dry mustard ",
      "2 egg whites ",
      "1 prebaked pizza crust (such as Boboli®) "
    ],
    "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nBring water to a boil in a saucepan. Cook asparagus until bright green and still crisp, 1 to 2 minutes. Drain asparagus and rinse under cold water to stop cooking. Pat dry with a towel.\nStir mayonnaise, Parmesan cheese, and dry mustard together in a bowl.\nBeat egg whites in a glass, metal, or ceramic bowl until stiff peaks form, 2 to 4 minutes; fold into mayonnaise mixture.\nPlace pre-baked pizza crust onto a baking sheet, arrange asparagus on crust, and spoon mayonnaise mixture on top.\nBake in the preheated oven until lightly brown, 8 to 10 minutes.\n",
    "pictureLink": "resources/static/images"
  },
 {
    "title": "Easy Snack Wraps",
	"course": "Snack",
	"totalTime": 15,
	"numberOfServings": 60,
    "ingredients": [
      "12 (10 inch) flour tortillas ",
      "1 (8 ounce) package cream cheese ",
      "1 head lettuce ",
      "1 (6 ounce) package sliced deli-style turkey ",
      "2 cups shredded carrots ",
      "2 cups minced tomato "
    ],
    "instructions": "Spread cream cheese evenly over the tortillas. Top the cream cheese with lettuce leaves. Arrange the turkey slices in even layers on top of the lettuce. Sprinkle the carrots and tomato over the turkey slices. Roll the tortillas into wraps. Cut the wraps diagonally into bite-sized pieces. Secure with toothpicks.\n",
    "pictureLink": "resources/static/images"
  }
]